{
  "ECAD": {
    "units": [
      {
        "heading": "Multistage Amplifiers",
        "description": " - Transistor at high frequencies\n - CE short circuit current gain and concept of Gain Bandwidth product\n - BJT and FET RC coupled amplifiers at low and high frequencies\n - Frequency response and calculation of Bandwidth of Multistage Amplifiers",
        "pdfName": "unit 1.pdf",
        "pdfSize": "3 MB",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1ThztJ3aKip2tLGTUpDokw9XMLzSR5dPg"
      },
      {
        "heading": "Feedback Amplifiers",
        "description": " - Concept of Feedback Amplifiers - Effect of Negative Feedback on the amplifier Characteristics\n - Four feedback topologies, Method of analysis of Voltage Series, Current Series, Voltage Shunt and Current Shunt feedback Amplifiers",
        "pdfName": "unit 2.pdf",
        "pdfSize": "2.7 MB",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1O5PYV8S8hetvHhxkLXH3BFFSaoUJbRVU"
      },
      {
        "heading": "Sinusoidal Oscillators",
        "description": "Condition for oscillations and types of Oscillators\n – RC Oscillators: RC Phase Shift and Wien bridge Oscillators\n - LC Oscillators: Hartley, Colpitts, Clapp, Tuned Collector and Crystal Oscillators",
        "pdfName": "unit 3.pdf",
        "pdfSize": "2.9 MB",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1Tm2FKg3wcvBDpp67dol7ah6XhegVJyBR"
      },
      {
        "heading": "Power Amplifiers and Tuned Voltage Amplifiers",
        "description": " - Classification of Power Amplifiers\n - Series fed, Transformer coupled class-A and class-BPower amplifiers\n - Push Pull Class-A, Class-B and Class-AB Power Amplifiers\n - Cross-over Distortion in Pure Class-B Power Amplifier and Class-AB Power Amplifier-Trickle Bias, Derating Factor and Heat Sinks – Complementary Push Pull Amplifier\n - Analysis of Single tuned, Double tuned and Stagger Tuned Amplifiers with gain and Bandwidth Calculations",
        "pdfName": "unit 4.pdf",
        "pdfSize": "2.1 MB",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1fy5NZkV3IPkQWlqh7Aa5MzABsG5rpoV8"
      }
    ],
    "textbooks": [
      {
        "bookName": "Electronic Devices and Circuits",
        "author": "Robert L Boylstead& Lewis Nashalsky",
        "description": "7th Edition",
        "link": "https://drive.google.com/uc?export=view&id=1jB53b9perukGVOM0H_Zgii7cqfv7kKRn"
      }
    ],
    "refbooks": [],
    "facultyChannels": [],
    "otherLinks": []
  },
  "BE": {
    "units": [
      {
        "heading": "Basic Circuit Theory & Measuring Instruments",
        "description": " - Independent DC & AC sources, Passive and active circuit components, Resistors, Inductors,Capacitors, V-I relationships, Series and parallel connections, Resistance, Reactance,Impedance, KVL, KCL, Concept of charging and discharging, Frequency response of a 1st order RC circuit\n - Basics of Voltmeter, Ammeter and Multimeter, Basics of CRO: Functional block diagram, Operation, Measurement of voltage and current amplitude along with frequency",
        "pdfName": "BE Unit 1.ppt",
        "pdfSize": "1.58 MB",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1sCeSs-G5mcCTiwNiIPLyyu2pdmivKIKj"
      },
      {
        "heading": "Semiconductor Materials and Properties",
        "description": " - Energy band theory of solids, Classification of Materials, Fermi-level, Intrinsic and Extrinsic semiconductors, P-type and N-type semiconductors, Mobility and conductivity, Dependence of conductivity on temperature, Charge densities, Drift and diffusion currents and their densities, Hall effect",
        "pdfName": "BE Unit 2.ppt",
        "pdfSize": "1.5 MB",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1VvEBw6MkVkkOFIndHw-vqDDoItNFXppX"
      },
      {
        "heading": "Fundamentals of P-N Junction Diode and Special Diodes",
        "description": " - Elementary concepts, Forward and reverse biased P-N junction, V-I characteristics, Linear piecewise model, DC load line, Applications of PN junction diode, Varactor diode, Zener diode, LED, Photo diode\n - Diode as a Rectifier: Half wave, Full wave rectifiers, PIV, DC voltage and current, Ripple factor, Efficiency, Capacitor filter, Zener diode as a voltage regulator",
        "pdfName": "BE Unit 3.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=18SZF-RH98k-1aG9H5d7OW8axssZXqpEJ"
      },
      {
        "heading": "Fundamentals of Transistors and Integrated Circuits (IC)",
        "description": " - Bipolar Junction Transistor (BJT) construction and Basic operation, Active, Cut-off, Saturation modes of operation, CB, CE and CC configurations, Input and Output characteristics, Early effect, Transistor as an Amplifier and a Switch, Comparison of three configurations, Advantages of FET over BJT, Junction-Field Effect Transistor (JFET) Operation,\n - Introduction to Integrated Circuits: Classification of ICs and Fabrication of Monolithic ICs. ",
        "pdfName": "BE Unit 4.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1yooGfUS1P5I00NSxNV2UUxRWuON0jk8q"
      },
      {
        "heading": "Digital Electronics (Introductory level only)",
        "description": " - Difference between analog and digital signals, Number Systems: Binary, Decimal, Octal, Hexa-Decimal number systems and Conversions among them, Logic Gates: AND, OR, NOT, XOR, NAND and NOR\n -  Half and Full adder/subtractor, Latches and Flip Flops: SR, JK, T, D flip-flops",
        "pdfName": "BE Unit 5.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1i9i-wTWqGm936oc_J_PmyVXCK0gujU3z"
      }
    ],
    "textbooks": [
      {
        "bookName": "Electronic Principles",
        "author": "Albert Paul Malvino",
        "description": "7th Edition",
        "link": "https://drive.google.com/uc?export=view&id=1hT7Q3IEDr5sn12b-F4Xubqujmji1YAsv"
      }
    ],
    "refbooks": [],
    "facultyChannels": [],
    "otherLinks": []
  },
  "CHEMISTRY": {
    "units": [],
    "textbooks": [],
    "refbooks": [
      {
        "refbookName": "Engineering Chemistry",
        "author": "Shikha Aharwal",
        "description": "Cambridge University\n      2nd Edition ",
        "link": "https://drive.google.com/uc?export=view&id=1W_cGwTJ7MBg7OKLugg3UIw7UaDWsUrsq"
      }
    ],
    "facultyChannels": [],
    "otherLinks": []
  },
  "BEE": {
    "units": [
      {
        "heading": "D.C Machines",
        "description": " - Principle of operation and construction of DC generator – EMF equation – types of DC machines – OCC of DC shunt generator - Torque equation of DC motor - applications – losses and efficiency - Brake test- Swinburne’s test - speed control of DC shunt motorSimple Problems. ",
        "pdfName": "BEE Unit 1.ppt",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1pnuACfm2JnE-u4NROGRV5VKf5_8lBcSb"
      },
      {
        "heading": "Introduction to AC Circuits",
        "description": " - Representation of sinusoidal waveforms - Peak, Average and RMS values - Phasor representation - power factor - Analysis of single-phase ac circuits consisting of pure resistor, pure inductor, pure capacitor, R-L, R-C, RLC series circuits-instantaneous powerreal power - reactive power - apparent power",
        "pdfName": "BEE Unit 2.ppt",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=14DqaUCj0k15QN31Kc7v3zF4ZSXOfskcy"
      },
      {
        "heading": "Transformers",
        "description": " - Principle of operation of Single-Phase Transformer – EMF equation - Losses and efficiency of transformer- Regulation of transformer- OC and SC tests on single phase transformerPredetermination of efficiency and regulation -Simple Problems",
        "pdfName": "BEE Unit 3.ppt",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1YxbwgR1ntWcud5CSt7IqHPAPERK6nCmK"
      },
      {
        "heading": "Induction Machines",
        "description": " - Principle of operation and construction of three phase Induction Motors- slip ring and squirrel cage motors-Torque Equation - Torque-Slip Characteristics- Brake test on three phase Induction motor- Simple Problems.",
        "pdfName": "BEE Unit 4.ppt",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1OdI3Ji70B_kYlJ-qsiHn0T6sZDSL5Cuc"
      },
      {
        "heading": "Synchronous Machines",
        "description": " - Principle of operation and construction of Alternators –Types of Alternators-EMF equation of three phase Alternator - Regulation of Alternator by Synchronous impedance method.\n - Principle of operation and construction of Synchronous Motor- Starting methods of Synchronous motor.",
        "pdfName": "BEE Unit 5.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1ZeF1ReVPt3T9izhDgs72a4wZb1-B_r8g"
      }
    ],
    "textbooks": [],
    "refbooks": [],
    "facultyChannels": [],
    "otherLinks": []
  },
  "CAO": {
    "units": [
      {
        "heading": "Register Transfer and Micro operations",
        "description": " - Register Transfer Language, Register Transfer, Bus and Memory Transfers, Arithmetic Micro operations, Logic Micro operations, Shift Micro operations, Arithmetic Logic Shift Unit. ",
        "pdfName": "CAO-1.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1somlMT1yBHY1h1JBiogCVUBw3n3oCpkG"
      },
      {
        "heading": "Basic Computer Organization",
        "description": " - Instruction Codes, Computer Registers, Computer Instructions, Timing and Control, Instruction Cycle, Memory Reference Instructions, Input - Output and Interrupt, Complete Computer Description",
        "pdfName": "CAO-2.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1g52_URI4ds5GDibqIzbNUKXEdggU0q1u"
      },
      {
        "heading": "Micro programmed Control & CPU Organization",
        "description": "Micro programmed Control\n - Control Memory, Address Sequencing, Microinstruction Formats, Microprogram Example and Design of Control Unit.\nCPU Organization:\n - Introduction, General Register Organization, Stack Organization Instruction Formats, Addressing Modes, Data Transfer and Manipulation, Program Control, Reduced Instruction Set Computer (RISC).",
        "pdfName": "CAO-3.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1cezm6FuSnYoyXqlViCFWC5_VLPpLynsI"
      },
      {
        "heading": "Input – Output Organization & Introduction to Pipelining",
        "description": "Peripheral Devices, Input - Output Interface, Asynchronous Data Transfer, Modes of Transfer, Priority Interrupt, Direct Memory Access (DMA), Input- Output processor, CPUIOP communication, Parallel Processing, Introduction to pipelining",
        "pdfName": "CAO-4.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1Dqn4MNyXZzvemboxmL4X5O-gbqTRkfFO"
      }
    ],
    "textbooks": [],
    "refbooks": [],
    "facultyChannels": [],
    "otherLinks": []
  },
  "LDIC": {
    "units": [
      {
        "heading": "applications of operational amplifiers",
        "description": " - Basics of Op-Amp, Block Diagram, Ideal characteristics, op-amp parameters, open loop, and closed loop op-amp configurations, Applications of op-amp- summing amplifier, subtractor, Basic Integrator, Basic differentiator, Logarithmic amplifier\n -  Instrumentation Amplifiers, Op-amp As a Comparators, Schmitt trigger, square wave generator",
        "pdfName": "LDIC-1.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1svq7gePqT-J-KMGHD7EK5tpuDZYlRivx"
      },
      {
        "heading": "active filters and oscillators",
        "description": " - Butterworth type LPF, HPF first and secondorder filters, Higher order filters, Wide Band pass filters, Wide band reject filter, All pass filters. OpAmp Phase Shift oscillator, Wein-bridge oscillator, Quadrature Oscillator, voltagecontrolled oscillators, Voltage to current and current to voltage converters",
        "pdfName": "LDIC-2.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=19fAwp3OTyYOiUdNpPht4GZ6kj-WwxJUW"
      },
      {
        "heading": "Special Ics",
        "description": " - Introduction, Block diagram, 555 timer as an Astable and Monostable Multivibrator, Applications of 555 Timer as Monostable multivibrator- Frequency divider, Pulse stretcher, Missing pulse detector, Linear ramp generator, Pulse width modulation, Applications of 555 Timer as Astable Multivibrator- Square wave oscillator, FSK Generator, Schmitt trigger.\n - IC 565: Block diagram of PLL and applications of PLL \n - IC 566 : Functional diagram of voltage controlled oscillator (IC 565) ",
        "pdfName": "LDIC-3.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1zbqdyaZvsTWTKH8aYwIKbWFMmaByVtPL"
      },
      {
        "heading": "D to A and A to D CONVERTERS",
        "description": "Introduction, basic DAC techniques – weighted resistor DAC, R-2R ladder DAC, inverted R-2R DAC, A to D converters - parallel comparator type ADC, counter type ADC, successive approximation ADC and dual slope ADC, DAC and ADC Specifications",
        "pdfName": "LDIC-4.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1U5uaGf0eQRPsJseCNdgH8Oavl-tac4Hg"
      }
    ],
    "textbooks": [
      {
        "bookName": "Linear Integrated Circuit",
        "author": "D. Roy Choudhury, Shail B. Jain",
        "description": "2th Edition",
        "link": "https://drive.google.com/uc?export=view&id=1DTAfGjrjCgeqFVdeNcPG9EczsPkXt3Js"
      }
    ],
    "refbooks": [],
    "facultyChannels": [],
    "otherLinks": []
  },
  "RVSP": {
    "units": [
      {
        "heading": "Probability Theory",
        "description": " - Definitions of Probability, Axioms of Probability, Probability Spaces, Properties of Probabilities, Joint and Conditional Probabilities, Independent Events",
        "pdfName": "RVSP UNIT 1.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1LqUavOV7NaSxrg7JxaBWUGhmEMehTOKc"
      },
      {
        "heading": "Random Variables",
        "description": " - Probability Distribution Function, Probability Density Function, Joint Distribution of Two Variables, Conditional Probability Distribution and Density, Independent Random Variables, Normal Distribution, Cauchy’s distribution, Exponential Distribution, Binomial Distribution, Poisson distribution, Functions of Random Variables",
        "pdfName": "RVSP UNIT 2.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=14N-IR46NHFRHsaIO7XPmkPn3R20gFhTH"
      },
      {
        "heading": "Statistical Averages",
        "description": " - Random Vectors, Statistical Averages, Characteristic Function of Random Variables, Inequalities of Chebyshev‟ s and Schwartz, Convergence Concepts, Central Limit Theorem",
        "pdfName": "RVSP UNIT 3.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1cp_2YOAxlCOQ-CyVaysdiDS_06nnKdUe"
      },
      {
        "heading": "Random Processes",
        "description": " - Introduction, Definitions, Stationarity, Ergodicity, Covariance Function and their Properties, Spectral Representation, Wiener- Khinchin Theorem ",
        "pdfName": "RVSP UNIT 4.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1O4dQSZqU41deimIUX7TfBb4qH2wJsOaV"
      },
      {
        "heading": "Linear Systems and Random Noise Processes",
        "description": ":Classification of Linear systems, Response of Linear Systems to Random signals, Spectral characteristics of system Response, Gaussian processes, Poisson Processes, Low-pass and Bandpass Noise Representation",
        "pdfName": "RVSP UNIT 5.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1KUHKabsY8QC8ym7E3SchRfVZMVnuQfiL"
      }
    ],
    "textbooks": [],
    "refbooks": [],
    "facultyChannels": [],
    "otherLinks": []
  },
  "PPSC": {
    "units": [
      {
        "heading": "Introduction to Computers",
        "description": " - Creating and running Programs, Computer Numbering System, Storing Integers, Storing Real Numbers Introduction to the C Language: Background, C Programs, Identifiers, Types, Variable, Constants, Input/output, Programming Examples, Scope, Storage Classes and Type Qualifiers. Structure of a C Program: Expressions Precedence and Associativity, Side Effects, Evaluating Expressions, Type Conversion Statements, Simple Programs, Command Line Arguments.",
        "pdfName": "PPSC UNIT 1.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1w80zcC9kNZQsZ8csezWAoNpiVoM8bHCa"
      },
      {
        "heading": "Bitwise Operators",
        "description": " -  Exact Size Integer Types, Logical Bitwise Operators, Shift Operators.\nSelection & Making Decisions:\n - Logical Data and Operators, Two Way Selection, Multiway Selection, More Standard Functions. Repetition: Concept of Loop, Pretest and Post-test Loops, Initialization and Updating, Event and Counter Controlled Loops, Loops in C, Other Statements Related to Looping, Looping Applications, Programming Examples",
        "pdfName": "PPSC UNIT 2.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1aQ98n2SdalRRE4Kv0XYU1Gfc2NUMDj7q"
      },
      {
        "heading": "Arrays",
        "description": " - Concepts, Using Array in C, Array Application, Two Dimensional Arrays, Multidimensional Arrays, Programming Example – Calculate Averages Strings: String Concepts, C String, String Input / Output Functions, Arrays of Strings, String Manipulation Functions String/ Data Conversion, A Programming Example – Morse Code Enumerated, Structure, and Union: The Type Definition (Type def), Enumerated Types, Structure, Unions, and Programming Application.",
        "pdfName": "PPSC UNIT 3.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1rfbkQ3cmaboehOE4aFBP7zSowEy4wYuF"
      },
      {
        "heading": "Pointers",
        "description": " - Introduction, Pointers to pointers, Compatibility, L value and R value Pointer\n - Applications: Arrays, and Pointers, Pointer Arithmetic and Arrays, Memory Allocation Function, Array of Pointers, Programming Application. Processor Commands: Processor Commands.",
        "pdfName": "PPSC UNIT 4.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1vbaetKSWgXRY2UunXC_HiLxypG6F909x"
      },
      {
        "heading": "Functions",
        "description": " - Designing, Structured Programs, Function in C, User Defined Functions, Inter Function Communication, Standard Functions, Passing Array to Functions, Passing Pointers to Functions, Recursion Text Input / Output: Files, Streams, Standard Library Input / Output Functions, Formatting Input / Output Functions, Character Input / Output Functions Binary Input / Output: Text versus Binary Streams, Standard Library, Functions for Files, Converting File Type",
        "pdfName": "PPSC UNIT 5.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1lkZclwe0u5V7eEeMgT7hENZAWv7RXj61"
      }
    ],
    "textbooks": [
      {
        "bookName": "",
        "author": "",
        "description": "",
        "link": "https://drive.google.com/uc?export=view&id="
      }
    ],
    "refbooks": [
      {
        "refbookName": "",
        "author": "",
        "description": "5th Edition",
        "link": ""
      }
    ],
    "facultyChannels": [],
    "otherLinks": [
      {
        "name": "",
        "TypeOfLink": "",
        "description": "",
        "link": "https://www.youtube.com/channel/"
      }
    ]
  }
  ,
  "SS": {
    "units": [
      {
        "heading": "Introduction to Continuous –Time and Discrete –Time signals and systems",
        "description": " - Continuous –Time and Discrete –Time signals, Signal Energy and Power, Periodic Signals, Even and odd Signals, continuous- Time complex Exponential and Sinusoidal Signals, Discrete –Time complex Exponential and Sinusoidal Signals and their Periodicity , The Unit Impulse and Unit step Functions, The Continuous-Time Unit impulse and Unit step Sequence, Continuous –Time and Discrete –Time Systems, Interconnections of Systems, Basic System Properties, Continuous–Time and Discrete Time LTI Systems: – The Graphical interpretation of Convolution Integral and The Convolution Sum, Causal LTI Systems Described by Differential and Difference Equations, Singularity Functions",
        "pdfName": "SS Unit 1.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1iIxxAYRjEGJf_eqq68PpsaQ04ZRO3kja"
      },{
        "heading": "Fourier Series Representation of Periodic Signals",
        "description": " - Introduction, Fourier Series Representation of continuous time Periodic Signals (Complex Exponential and Trigonometric Fourier Series only), convergence of the Fourier Series, Properties of continuous time Fourier Series, Fourier Series representation of discrete time periodic signals, Properties of discrete time Fourier Series (Elementary Level on DTFS)",
        "pdfName": "SS Unit 2-3.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1d4vITzarr1ODK-AnbhlsTdgki8dV63jw"
      },{
        "heading": "Continuous and Discrete time Fourier Transform",
        "description": " - Introduction, Representation of Aperiodic signals, The continuous time Fourier Transform, The Fourier Transform for periodic signals, Properties of the continuous time Fourier Transform, Systems characterized by linear constant coefficient differential equations. Discrete time Fourier Transform, Properties of the Discrete time Fourier Transform, Systems characterized by linear constant coefficient differential equations (Elementary Level on DTFT).",
        "pdfName": "SS Unit 3.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=14Y8WIshTYTFDU0wLq44MxQrxlShj5EMY"
      },{
        "heading": "Laplace Transform",
        "description": " - Introduction, The Laplace Transform, the region of convergence for Laplace Transforms, The Inverse Laplace Transform, Properties of Laplace Transforms, The initial and Final value theorems, Analysis and characterization of LTI systems using the Laplace Transforms. ",
        "pdfName": "SS Unit 4.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1Ot4mtv1MuKbph62e87o-bJKHz8Qli0Ss"
      },{
        "heading": "Sampling Theorem and Z-transform",
        "description": " - Introduction to Sampling Theorem, Statement of Sampling Theorem for Low pass and Band pass signals (Theorem Proof for Low Pass signals only), reconstruction of a signal from its samples using interpolation, discussion on Oversampling, Critical sampling and Under sampling (aliasing). The Z-Transform (Bilateral and unilateral), The Inverse ZTransform, Properties of Z-Transform, Initial and Final Value theorems, some common Ztransform pairs, Analysis and characterization of LTI systems using the Z-Transforms.",
        "pdfName": "z-transforms.pdf",
        "pdfSize": "-",
        "pdfLink": "https://drive.google.com/uc?export=view&id=1fCqKvXaFYUYf83n1KSAUZ03hQrUsZlnO"
      }
    ],
    "textbooks": [
    
    ],
    "refbooks": [
     
    ],
    "facultyChannels": [],
    "otherLinks": [
      {
        "name": "",
        "TypeOfLink": "",
        "description": "",
        "link": "https://www.youtube.com/channel/"
      }
    ]
  }
  ,
  "Example": {
    "units": [
      {
        "heading": "",
        "description": "",
        "pdfName": "",
        "pdfSize": "",
        "pdfLink": "https://drive.google.com/uc?export=view&id="
      }
    ],
    "textbooks": [
      {
        "bookName": "",
        "author": "",
        "description": "",
        "link": "https://drive.google.com/uc?export=view&id="
      }
    ],
    "refbooks": [
      {
        "refbookName": "",
        "author": "",
        "description": "5th Edition",
        "link": ""
      }
    ],
    "facultyChannels": [],
    "otherLinks": [
      {
        "name": "",
        "TypeOfLink": "",
        "description": "",
        "link": "https://www.youtube.com/channel/"
      }
    ]
  }
}
